?- consult('cmeans.pro').
true.

?- distanceR2([1, 2], [2, 3], What).
What = 2.

?- distanceR2([1], [3], What).
What = 4.

?- distanceR2([3,3,3], [3,3,3], What).
What = 0.

?- distanceSqAllMeans([1,2,3], [[1,2,3],[4,5,6]], What).
What = [0, 27] .

?- distanceSqAllMeans([2,2,3], [[3,2,1],[4,5,6]], What).
What = [5, 22] .

?- distanceSqAllMeans([2,2,3], [[3,2,1],[4,5,6],[1,1,1]], What).
What = [5, 22, 6] .

?- listMinPos([1,2,3,4], What).
What = 0 .

?- listMinPos([3,3,3], What).
What = 0 .

?- listMinPos([9,1,1], What).
What = 1 .

?- elsum([1,2,3], [1,2,3], What).
What = [2, 4, 6].

?- elsum([1,2,3], [3,2,1], What).
What = [4, 4, 4].

?- elsum([-1,-2,-3], [3,2,1], What).
What = [2, 0, -2].

?- scaleList([1,2,3,4,5], 0, What).
What = [1, 2, 3, 4, 5].

?- scaleList([1,2,3,4,5], 1, What).
What = [1, 2, 3, 4, 5] .

?- scaleList([1,2,3,4,5], 2, What).
What = [0.5, 1, 1.5, 2, 2.5] .

?- zeroes(30, What).
What = [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0|...] .

?- zeroes(10, What).
What = [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0|...] .

?- zeroes(0, What).
What = [] .

?- zeroMeansSet(4, 3, What).
What = [[0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0], [0.0, 0.0, 0.0]] .

?- zeroMeansSet(1, 1, What).
What = [[0.0]] .

?- zeroMeansSet(1, 10, What).
What = [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0|...]] .

?- zeroVdiff([1,2,3], [1,2,3]).
true.

?- zeroVdiff([1,2], [2,1]).
false.

?- zeroVdiff([1], [1]).
true.

?- zeroSetDiff([[1,2], [2,3]], [[1,2], [2,3]]).
true.

?- zeroSetDiff([[1,2], [2,3]], [[1,2], [2,3]]).
true.

?- zeroSetDiff([[1,1], [1,1]], [[1,1], [1,1]]).
true.

?- zeroCounts(30, What).
What = [0, 0, 0, 0, 0, 0, 0, 0, 0|...] .

?- zeroCounts(10, What).
What = [0, 0, 0, 0, 0, 0, 0, 0, 0|...] .

?- zeroCounts(0, What).
What = [] .

?- updateCounts(2, [1,2,3], What).
What = [1, 2, 4] .

?- updateCounts(2, [1,2,3], What).
What = [1, 2, 4] .

?- updateCounts(0, [1,2,3], What).
What = [2, 2, 3] .

?- zeroMeansSet(4, 4, M),
|    updateMeansSum([1.0, 3.0, 2.0, 4.0], 0, M, What).
M = [[0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0]],
What = [[1.0, 3.0, 2.0, 4.0], [0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0]] .

?- zeroMeansSet(6, 2, M),
|    updateMeansSum([1.0, 3.0], 2, M, What).
M = [[0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0]],
What = [[0.0, 0.0], [0.0, 0.0], [1.0, 3.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0]] .

?- zeroMeansSet(3, 2, M),
|    updateMeansSum([1.0, 3.0], 0, M, What).
M = [[0.0, 0.0], [0.0, 0.0], [0.0, 0.0]],
What = [[1.0, 3.0], [0.0, 0.0], [0.0, 0.0]] .

?- formNewMeans([[99, 33], [0, 0]], [3, 3], What).
What = [[33, 11], [0, 0]] .

?- formNewMeans([[99, 33], [0, 0]], [0, 0], What).
What = [[99, 33], [0, 0]].

?- formNewMeans([[99], [33], [3]], [3, 3, 3], What).
What = [[33], [11], [1]] .

?- reclassify([[1,2,3], [3,4,5]], [[1,2,3], [3,4,5]], What).
What = [[1.0, 2.0, 3.0], [3.0, 4.0, 5.0]] .

?- reclassify([[1,2,3], [3,4,5]], [[1,2,2], [4,4,5]], What).
What = [[1.0, 2.0, 3.0], [3.0, 4.0, 5.0]] .

?- reclassify([[1,2,3], [3,4,5]], [[4,4,2], [1,1,1]], What).
What = [[3.0, 4.0, 5.0], [1.0, 2.0, 3.0]] .

?- cmeans([[1,1], [1,3], [3,1], [10,3], [9,1]], [[1,1], [7,1]], What).
What = [[1.6666666666666667, 1.6666666666666667], [9.5, 2.0]].

?- cmeans([[1,1], [1,3], [3,1], [10,3], [9,1]], [[1,1], [7,1]], What).
What = [[1.6666666666666667, 1.6666666666666667], [9.5, 2.0]].

?- cmeans([[1,1], [1,3], [3,1], [10,3], [9,1]], [[-300,-200], [9999,999]], What).
What = [[9.5, 2.0], [1.6666666666666667, 1.6666666666666667]].